{
  "Методы": {
    "title": "Строковые методы",
    "theory": "Методы строк позволяют быстро проверять и преобразовывать текст без дополнительных циклов и условных операторов.",
    "isalpha": {
      "title": "str.isalpha",
      "summary": "Возвращает True, если все символы строки являются буквами.",
      "theory": "Метод str.isalpha() проверяет, состоит ли строка только из буквенных символов. Часто используется перед обработкой пользовательского ввода, чтобы убедиться, что текст не содержит цифр или служебных знаков.",
      "tasks": ["task1"]
    },
    "isdigit": {
      "title": "str.isdigit",
      "summary": "Проверяет, содержит ли строка только цифры.",
      "theory": "Метод str.isdigit() возвращает True, если в строке находятся только цифровые символы. Он удобен для простой валидации вводимых чисел перед преобразованием функцией int().",
      "tasks": ["task2"]
    },
    "islower": {
      "title": "str.islower",
      "summary": "Истина, если все буквы строки — в нижнем регистре.",
      "theory": "Метод str.islower() помогает определить, находится ли строка полностью в нижнем регистре. Это полезно, когда нужно реагировать на форматирование пользовательского ввода или привести текст к нужному виду.",
      "tasks": []
    }
  },
  "Основы": {
    "title": "Базовые конструкции Python",
    "theory": "Вспомни ключевые конструкции языка: объявление функций, ветвления и циклы. Они используются во всех практических заданиях.",
    "def": {
      "title": "Определение функций",
      "summary": "Повторяем синтаксис ключевого слова def и принципы написания функций.",
      "theory": "Функции позволяют объединять повторно используемый код в именованные блоки. При объявлении функции указывается список параметров и, при необходимости, возвращаемое значение через return.",
      "tasks": []
    },
    "loops": {
      "title": "Циклы",
      "summary": "for и while помогают многократно выполнять блок кода.",
      "theory": "Циклы позволяют обрабатывать последовательности и повторять действия. for перебирает элементы коллекции, а while выполняется, пока условие истинно.",
      "tasks": []
    }
  }
}
